In [1]:
import pandas as pd

titanic_df = pd.read_csv('train.csv')

In [2]:
titanic_groupby = titanic_df.groupby(by='Pclass')
print(type(titanic_groupby))

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

In [3]:
titanic_groupby = titanic_df.groupby('Pclass').count() #Pclass 별로 묶어 counting
print(titanic_groupby)

        PassengerId  Survived  Name  Sex  Age  SibSp  Parch  Ticket  Fare  \
Pclass
1               216       216   216  216  186    216    216     216   216
2               184       184   184  184  173    184    184     184   184
3               491       491   491  491  355    491    491     491   491

        Cabin  Embarked
Pclass
1         176       214
2          16       184
3          12       491

In [4]:
titanic_groupby = titanic_df.groupby('Pclass')[['PassengerId', 'Survived']].count() #PassengerId, Survived 열만 출력
titanic_groupby

        PassengerId  Survived
Pclass
1               216       216
2               184       184
3               491       491

In [ ]:
titanic_df.groupby('Pclass')['Age'].agg(['max', 'min']) # Pclass별 Age의 최대, 최소

         max   min
Pclass
1       80.0  0.92
2       70.0  0.67
3       74.0  0.42

In [9]:
agg_format = {'Age':'max', 'SibSp':'sum', 'Fare':'mean'} # dict 형태로 집계함수 사용
titanic_df.groupby('Pclass').agg(agg_format) # Pclass별 Age의 최대, Sibsp의 합계, Fare의 최소값

         Age  SibSp       Fare
Pclass
1       80.0     90  84.154687
2       70.0     74  20.662183
3       74.0    302  13.675550